rezaandriady/T2G_TLE9185_BLDC_MotorControl/TLE9185_BLDC.c
/***************************************************************************//**
* \file main_cm0.c
*
* \version 1.0
*
* \brief Main example file for CM0plus
*
********************************************************************************
* \copyright
* Copyright 2016-2020, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


/*****************************************************************************
* Include files
*****************************************************************************/
#include "cy_project.h"
#include "cy_device_headers.h"
#include "TLE9185-reg.h"

/*****************************************************************************
* Local pre-processor symbols/macros ('define')
*****************************************************************************/
#define VCU_CONNECT                     0
#define PID_UPDATE                      1

#define TLE9xxx_CMD_WRITE          	0x80
#define TLE9xxx_CMD_READ          	0x00
#define TLE9xxx_CMD_CLEAR          	0x80
#define ACTIVE_MOSFET                   0
#define FW_MOSFET                       1
#define AGC_ACTIVE                      1

// Clock
#define SOURCE_CLOCK_FRQ                80000000ul
#define CORE_CLOCK_FRQ                  80000000ul

// Schedule Timer
#define Timer_DIV_NUM                   1ul

#define Timer_WD_TYPE                   TCPWM0_GRP0_CNT0
#define Timer_WD_PCLK                   PCLK_TCPWM0_CLOCKS0
#define Timer_WD_IRQN                   tcpwm_0_interrupts_0_IRQn

#define Timer_100ms_TYPE                TCPWM0_GRP0_CNT1
#define Timer_100ms_PCLK                PCLK_TCPWM0_CLOCKS1
#define Timer_100ms_IRQN                tcpwm_0_interrupts_1_IRQn

#define Timer_10ms_TYPE                TCPWM0_GRP0_CNT2
#define Timer_10ms_PCLK                PCLK_TCPWM0_CLOCKS2
#define Timer_10ms_IRQN                tcpwm_0_interrupts_2_IRQn

// PWM
#define PWM_DIV_NUM                     0u
#define PWM_PERIOD                      (0x140-1)   // 2MHz / 80 (0x50) = 25kH

#define PWM_A_TYPE                      TCPWM0_GRP0_CNT27
#define PWM_A_PCLK                      PCLK_TCPWM0_CLOCKS27

#define PWM_B_TYPE                      TCPWM0_GRP1_CNT11
#define PWM_B_PCLK                      PCLK_TCPWM0_CLOCKS267

#define PWM_C_TYPE                      TCPWM0_GRP0_CNT31
#define PWM_C_PCLK                      PCLK_TCPWM0_CLOCKS31

// SPI
#define SCB_SPI_BAUDRATE                125000ul /* Please set baudrate value of SPI you want */
#define SCB_SPI_OVERSAMPLING            16ul     /* Please set oversampling of SPI you want */
#define SCB_SPI_CLOCK_FREQ              (SCB_SPI_BAUDRATE * SCB_SPI_OVERSAMPLING)

#define CY_SPI_SCB_TYPE                 SCB6
#define CY_SPI_SCB_PCLK                 PCLK_SCB6_CLOCK
#define CY_SPI_SCB_IRQN                 scb_6_interrupt_IRQn
#define DIVIDER_NO_1                    1u

#define BB_POTI_ANALOG_MACRO        CY_ADC_POT_MACRO
#define BB_POTI_ANALOG_PCLK         CY_ADC_POT_PCLK
#define BB_POTI_ANALOG_INPUT_NO    ((cy_en_adc_pin_address_t)CY_ADC_POT_IN_NO)
#define ADC_OPERATION_FREQUENCY_MAX_IN_HZ       (26670000ul)
#define ANALOG_IN_SAMPLING_TIME_MIN_IN_NS       (412ull)
#define DIV_ROUND_UP(a,b)                       (((a) + (b)/2) / (b))
#define ADC_LOGICAL_CHANNEL                     0

#define HALL_CHANGE_BUFFER_SIZE                 8

/*****************************************************************************
* Global variable definitions (declared in header file with 'extern')
*****************************************************************************/

/*****************************************************************************
* Local type definitions ('typedef')
*****************************************************************************/
typedef struct
{
  uint8_t MODE;
  uint8_t VCC1_OV_MOD;
  bool RSTN_HYS;
  bool I_PEAK_TH;
  uint8_t VCC1_RT;
} M_S_CTRL_cfg_t;

typedef struct
{
  bool WD_STM_EN_1;
  bool SOFT_RESET_RO;
  bool RSTN_DEL;
  bool SH_DISABLE;
  bool VS_OV_SEL;
  bool TSD2_DEL;
} HW_CTRL_cfg_t;

typedef struct
{
  bool SUPPLY_STAT;
  bool TEMP_STAT;
  bool BD_STAT;
  bool SPI_CRC_FAIL;
  bool WD_SDM;
  bool WD_SDM_DISABLE;
  bool INTN_CYC_EN;
} INT_MASK_cfg_t;

typedef struct
{
  uint8_t ICHG;
  uint8_t IDCHG;
} HB_ICHG_cfg_t;

typedef struct
{
  uint8_t TCCP;
  uint8_t TBLANK;
} CCP_BLK_cfg_t;

typedef struct
{
  uint8_t PCHGINIT;
  uint8_t PDCHGINIT;
} PCHG_INIT_cfg_t;

typedef struct
{
  uint8_t TDON;
} TDON_HB_CTRL_cfg_t;

typedef struct
{
  uint8_t TDOFF;
} TDOFF_HB_CTRL_cfg_t;

typedef struct
{
  uint8_t TPCHG1;
  uint8_t TPCHG2;
  uint8_t TPCHG3;
} TPRECHG_cfg_t;

typedef struct
{
  uint8_t ICHGMAX1;
  uint8_t ICHGMAX2;
  uint8_t ICHGMAX3;
  bool HB1IDIAG;
  bool HB2IDIAG;
  bool HB3IDIAG;
} HB_ICHG_MAX_cfg_t;

typedef struct
{
  uint8_t ICHGST1;
  uint8_t ICHGST2;
  uint8_t ICHGST3;
} ST_ICHG_cfg_t;

typedef struct
{
  bool FMODE;
  bool IHOLD;
  bool EN_GEN_CHECK;
  bool AGCFILT;
  bool POCHGDIS;
  bool CPEN;
  bool AGC;
  bool IPCHGADT;
  bool BDOV_REC;
  bool CPSTGA;
  bool FET_LVL;
  bool CPUVTH;
  bool BDFREQ;
} GENCTRL_cfg_t;

typedef struct
{
  uint8_t HS1VDSTH;
  uint8_t HS2VDSTH;
  uint8_t HS3VDSTH;
  bool DEEP_ADAP;
} HS_VDS_cfg_t;

typedef struct
{
  uint8_t LS1VDSTH;
  uint8_t LS2VDSTH;
  uint8_t LS3VDSTH;
  bool TFVDS;
} LS_VDS_cfg_t;

typedef struct
{
  bool OCEN;
  uint8_t CSAG;
  uint8_t OCTH;
  bool CSA_OFF;
  uint8_t OCFILT;
  bool CSD;
  bool CSO_CAP;
  bool PWM_NB;
} CSA_cfg_t;

typedef struct
{
  uint8_t WD_TIMER;
  bool WD_CFG;
  bool WD_STM_EN_0;
  bool CHECKSUM;
} WD_CTRL_cfg_t;

typedef struct
{
  bool PWM_EN;
  bool AFW;
  uint8_t HBmode;
} HBMODE_cfg_t;

