rezaandriady/T2G_TLE9185_BLDC_MotorControl/TLE9185_BLDC.c
typedef struct {
  float dt;
  float Kp;
  float Ki;
  float Kd;
  float integral;
  float prevErr;
} PID_t;

/*****************************************************************************
* Local variable definitions ('static')
*****************************************************************************/
// Default WD_CTRL config, will be used during TLE9185 transition from Init to Normal Mode
WD_CTRL_cfg_t WD_CTRL_cfg =
{
  .WD_TIMER = 7ul,
  .WD_CFG = 0ul,
  .WD_STM_EN_0 = 1ul,
  .CHECKSUM = 0ul,
};

INT_MASK_cfg_t INT_MASK_cfg =
{
  .SUPPLY_STAT = 0,
  .TEMP_STAT = 0,
  .BD_STAT = 0,
  .SPI_CRC_FAIL = 0,
  .WD_SDM = 0,
  .WD_SDM_DISABLE = 1,
  .INTN_CYC_EN = 0,
};

M_S_CTRL_cfg_t M_S_CTRL_cfg =
{
  .MODE = 0,
  .VCC1_OV_MOD = 0,
  .RSTN_HYS = 0,
  .I_PEAK_TH = 0,
  .VCC1_RT = 0,
};

HW_CTRL_cfg_t HW_CTRL_cfg = 
{
  .WD_STM_EN_1 = 0,
  .SOFT_RESET_RO = 0,
  .RSTN_DEL = 0,
  .SH_DISABLE = 0,
  .VS_OV_SEL = 1,
  .TSD2_DEL = 0,
};

HB_ICHG_cfg_t HB_ICHG_Active_cfg = 
{
  .ICHG = 7,
  .IDCHG = 7,
};

HB_ICHG_cfg_t HB_ICHG_FW_cfg =
{
  .ICHG = 43,
  .IDCHG = 0,
};

CCP_BLK_cfg_t CCP_BLK_Active_cfg = 
{
  .TCCP = 10,
  .TBLANK = 11,
};

CCP_BLK_cfg_t CCP_BLK_FW_cfg = 
{
  .TCCP = 1,
  .TBLANK = 1,
};

PCHG_INIT_cfg_t PCHG_INIT_cfg = 
{
  .PCHGINIT = 23,
  .PDCHGINIT = 44,
};

TDON_HB_CTRL_cfg_t TDON_HB_CTRL_cfg = 
{
  .TDON = 18,
};

TDOFF_HB_CTRL_cfg_t TDOFF_HB_CTRL_cfg = 
{
  .TDOFF = 20,
};

TPRECHG_cfg_t TPRECHG_PCHG_cfg = 
{
  .TPCHG1 = 1,
  .TPCHG2 = 1,
  .TPCHG3 = 1,
};

TPRECHG_cfg_t TPRECHG_PDCHG_cfg = 
{
  .TPCHG1 = 3,
  .TPCHG2 = 3,
  .TPCHG3 = 3,
};

HB_ICHG_MAX_cfg_t HB_ICHG_MAX_cfg = 
{
  .ICHGMAX1 = 3,
  .ICHGMAX2 = 3,
  .ICHGMAX3 = 3,
  .HB1IDIAG = 0,
  .HB2IDIAG = 0,
  .HB3IDIAG = 0,
};

ST_ICHG_cfg_t ST_ICHG_cfg = 
{
  .ICHGST1 = 8,
  .ICHGST2 = 8,
  .ICHGST3 = 8,
};

HS_VDS_cfg_t HS_VDS_cfg = 
{
  .HS1VDSTH = 7,
  .HS2VDSTH = 7,
  .HS3VDSTH = 7,
  .DEEP_ADAP = 1,
};

LS_VDS_cfg_t LS_VDS_cfg = 
{
  .LS1VDSTH = 7,
  .LS2VDSTH = 7,
  .LS3VDSTH = 7,
  .TFVDS = 0,
};

HBMODE_cfg_t Active_PWM =
{
  .PWM_EN = 1,
  .AFW = 1,
  .HBmode = 2,
};

HBMODE_cfg_t Active_GND =
{
  .PWM_EN = 0,
  .AFW = 0,
  .HBmode = 1,
};

HBMODE_cfg_t Floating =
{
  .PWM_EN = 0,
  .AFW = 0,
  .HBmode = 3, // suspect -> if set to 3, current will rise when lock //not proven
};

PID_t pid =
{
  .dt = 0.1f,
  .Kp = 0.5,
  .Ki = 0,
  .Kd = 0.1,
  .integral = 0.0f,
  .prevErr = 0.0f,
};

bool SPI_Pending = 0;
uint8_t SPI_Read_data[4];
uint8_t SPI_Send_data[4];

uint8_t const hall_state_table[] = {6, 4, 5, 2, 1, 3};
uint8_t const hall_state_table_fast[] = {5, 3, 4, 1, 6, 2};

bool    motor_dir = 1;
uint8_t bldc_state = 6;
uint32_t PWM_DC = 50;
uint32_t PWM_CC0 = 1;
uint8_t hall_state = 0;
uint8_t old_hall_state = 6;

uint8_t hall_buffer_idx = 8;
uint32_t hall_change_count = 0;
uint32_t hall_change_count_temp_buff[HALL_CHANGE_BUFFER_SIZE] = {0};
uint32_t hall_change_count_temp = 0;
uint32_t hall_RPM = 0;

uint16_t WD_CTRL_data;

uint16_t POT_ADC_RES;
cy_stc_adc_ch_status_t POT_ADC_STAT;

uint16_t CSO_ADC_RES;
cy_stc_adc_ch_status_t CSO_ADC_STAT;

uint32_t CSO_ADC_THRESH = 0xBFF;
uint8_t OCD_CNT;
uint8_t OCD_CNT_THRESH = 50;
bool OCD_ACT_RESET = 1;

uint32_t hall_count_target;

bool BLDC_reset = 0;
bool BLDC_rampup;
bool BLDC_running;

/*****************************************************************************
* Local function prototypes ('static')                                                                            
*****************************************************************************/
void SetPeripheFracDiv24_5(uint64_t targetFreq, uint64_t sourceFreq, uint8_t divNum);

void TLE9185_Reset();
void TLE9185_Init();
void TLE9185_EnCRC();
void TLE9185_DisCRC();
void TLE9185_M_S_CTRL_Set(M_S_CTRL_cfg_t M_S_CTRL_cfg);
void TLE9185_HW_CTRL_Set(HW_CTRL_cfg_t HW_CTRL_cfg);
void TLE9185_HB_ICHG_Set(HB_ICHG_cfg_t HB_ICHG_cfg, bool ACTorFW, uint8_t HB);
void TLE9185_CCP_BLK_Set(CCP_BLK_cfg_t CCP_BLK_cfg, bool ACTorFW, uint8_t HB);
void TLE9185_PCHG_INIT_Set(PCHG_INIT_cfg_t PCHG_INIT_cfg, uint8_t init_bnk);
void TLE9185_TDON_HB_CTRL_Set(TDON_HB_CTRL_cfg_t TDON_HB_CTRL_cfg, uint8_t hb_tdon_bnk);
void TLE9185_TDOFF_HB_CTRL_Set(TDOFF_HB_CTRL_cfg_t TDOFF_HB_CTRL_cfg, uint8_t hb_tdoff_bnk);
void TLE9185_TPRECHG_Set(uint8_t t_pchgx, uint8_t t_pdchgx);
void TLE9185_HB_ICHG_MAX_Set(uint8_t hbxidiag, uint8_t ichgMaxx);
void TLE9185_ST_ICHG_Set(uint8_t ichgst1, uint8_t ichgst2, uint8_t ichgst3);
void TLE9185_GENCTRL_Set();		
void TLE9185_HS_VDS_Set(uint8_t vdsth, bool deep_adap, uint8_t tfvds);
void TLE9185_LS_VDS_Set(uint8_t vdsth, bool deep_adap, uint8_t tfvds);
void TLE9185_CSA_Set(uint8_t octh, uint8_t csag, bool ocen);
void TLE9185_WD_CTRL_Set(WD_CTRL_cfg_t WD_CTRL_cfg);
void TLE9185_INT_MASK_Set(INT_MASK_cfg_t INT_MASK_cfg);
void TLE9185_HBMODE_Set(HBMODE_cfg_t PWMA, HBMODE_cfg_t PWMB, HBMODE_cfg_t PWMC);

void Timer_Init();
void Timer_100ms_Handler();
void Timer_10ms_Handler();
void Timer_WD_Handler();

void Hall_Init();
void Hall_RPM_Count();

void PWM_Init();
void PWM_BLDC_Control();

int clamp(int val, int min, int max);
#if (PID_UPDATE)
int PID_Update(PID_t *pid, int actual, int target);
#else
int PWM_CC0_Update(void);
#endif
void PID_Reset(PID_t *controller);

void SPI_Init();
void SPI_WriteReg(uint8_t addr, uint16_t data);
void SPI_ReadReg(uint8_t addr);
void SPI_ISR(void);

void SPI_HBMODE_Set(HBMODE_cfg_t stateA, HBMODE_cfg_t stateB, HBMODE_cfg_t stateC);

void ADC_Init(void);
void POT_ADC_ISR(void);
void CSO_ADC_ISR(void);

/*****************************************************************************
* Function implementation - global ('extern') and local ('static')
*****************************************************************************/

/**
*****************************************************************************
** Main function configures the HW and tasks and starts the OS
**
** \return none
*****************************************************************************/
int main(void)
{
  SystemInit();
  
