rezaandriady/T2G_TLE9185_BLDC_MotorControl/TLE9185_BLDC.c
  __enable_irq(); /* Enable global interrupts. */
  
  SPI_Init();
  
  TLE9185_Init(AGC_ACTIVE);
  
  ADC_Init();
  Timer_Init();
  
  // PWM Initialization conducted after Init to disable SPI CRC (PWM1/CRC pin = HIGH_Z)
  PWM_Init();
  
  Hall_Init();
  
  for(;;)
  {
    Cy_SysTick_DelayInUs(10);
    PWM_BLDC_Control();
    
    if (BLDC_reset)
    {
      PID_Reset(&pid);

      Cy_GPIO_Write(GPIO_PRT21, 5, 1);

      hall_change_count = 0;
      hall_change_count_temp = 0;
      hall_RPM = 0;
      PWM_CC0 = 1;
      BLDC_rampup = 1;
      hall_state = (GPIO_PRT7->unIN.u32Register >> 3);

      TLE9185_Reset();
    }
  }
}

void TLE9185_Reset()
{
  TLE9185_Init(AGC_ACTIVE);
  BLDC_reset = 0;
};

void TLE9185_Init()
{ 
  // TLE9185 in Init Mode, SPI write to transition into Normal Mode
  // Recommended to write into WD_CTRL as the first SPI command in Init
  TLE9185_WD_CTRL_Set(WD_CTRL_cfg);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_DisCRC();
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_HW_CTRL_Set(HW_CTRL_cfg);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_M_S_CTRL_Set(M_S_CTRL_cfg);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_INT_MASK_Set(INT_MASK_cfg);
  Cy_SysTick_DelayInUs(2000);
  
  for(uint8_t i = 0; i <= 2; i++)
  {
    TLE9185_HB_ICHG_Set(HB_ICHG_Active_cfg, ACTIVE_MOSFET, i);
    Cy_SysTick_DelayInUs(2000);
    SPI_ReadReg(REG_ADDR_HB_ICHG);
    Cy_SysTick_DelayInUs(2000);
    SPI_ReadReg(REG_ADDR_DEV_STAT);
    Cy_SysTick_DelayInUs(2000);
    
    TLE9185_HB_ICHG_Set(HB_ICHG_FW_cfg, FW_MOSFET, i);
    Cy_SysTick_DelayInUs(2000);
    SPI_ReadReg(REG_ADDR_HB_ICHG);
    Cy_SysTick_DelayInUs(2000);
    
    TLE9185_CCP_BLK_Set(CCP_BLK_Active_cfg, ACTIVE_MOSFET, i);
    Cy_SysTick_DelayInUs(2000);
    SPI_ReadReg(REG_ADDR_CCP_BLK);
    Cy_SysTick_DelayInUs(2000);
    
    TLE9185_CCP_BLK_Set(CCP_BLK_FW_cfg, FW_MOSFET, i);
    Cy_SysTick_DelayInUs(2000);
    SPI_ReadReg(REG_ADDR_CCP_BLK);
    Cy_SysTick_DelayInUs(2000);
    
    TLE9185_PCHG_INIT_Set(PCHG_INIT_cfg, i);
    Cy_SysTick_DelayInUs(2000);
    SPI_ReadReg(REG_ADDR_HB_PCHG_INIT);
    Cy_SysTick_DelayInUs(2000);
    
    TLE9185_TDON_HB_CTRL_Set(TDON_HB_CTRL_cfg, i);
    Cy_SysTick_DelayInUs(2000);
    SPI_ReadReg(REG_ADDR_TDON_HB_CTRL);
    Cy_SysTick_DelayInUs(2000);
    
    TLE9185_TDOFF_HB_CTRL_Set(TDOFF_HB_CTRL_cfg, i);
    Cy_SysTick_DelayInUs(2000);
    SPI_ReadReg(REG_ADDR_TDOFF_HB_CTRL);
    Cy_SysTick_DelayInUs(2000);
  }
  
  TLE9185_TPRECHG_Set(1, 3);
  Cy_SysTick_DelayInUs(2000);
  SPI_ReadReg(REG_ADDR_TPRECHG);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_HB_ICHG_MAX_Set(0, 3);
  Cy_SysTick_DelayInUs(2000);
  SPI_ReadReg(REG_ADDR_HB_ICHG_MAX);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_ST_ICHG_Set(8, 8, 8);
  Cy_SysTick_DelayInUs(2000);
  SPI_ReadReg(REG_ADDR_ST_ICHG);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_GENCTRL_Set();
  Cy_SysTick_DelayInUs(2000);
  SPI_ReadReg(REG_ADDR_GENCTRL);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_HS_VDS_Set(7, 1, 0);
  Cy_SysTick_DelayInUs(2000);
  SPI_ReadReg(REG_ADDR_HS_VDS);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_LS_VDS_Set(7, 1, 0);
  Cy_SysTick_DelayInUs(2000);
  SPI_ReadReg(REG_ADDR_LS_VDS);
  Cy_SysTick_DelayInUs(2000);
  
  TLE9185_CSA_Set(3, 1, 0);
  Cy_SysTick_DelayInUs(2000);
  SPI_ReadReg(REG_ADDR_CSA);
  Cy_SysTick_DelayInUs(2000);
  
  SPI_WriteReg(REG_ADDR_DEV_STAT, 0);
  Cy_SysTick_DelayInUs(2000);
  
  SPI_WriteReg(REG_ADDR_SUP_STAT, 0);
  Cy_SysTick_DelayInUs(2000);
};

void TLE9185_EnCRC()
{
  SPI_Send_data[0] = 0xE7;
  SPI_Send_data[1] = 0xAA;
  SPI_Send_data[2] = 0xAA;
  SPI_Send_data[3] = 0x0E;
  Cy_SCB_SPI_WriteArray(CY_SPI_SCB_TYPE, (void*)(SPI_Send_data), 4);
};

void TLE9185_DisCRC()
{  
  Cy_GPIO_Write(GPIO_PRT21, 5, 0);
  
  SPI_Send_data[0] = 0xE7;
  SPI_Send_data[1] = 0xAA;
  SPI_Send_data[2] = 0xAA;
  SPI_Send_data[3] = 0xC3;
  Cy_SCB_SPI_WriteArray(CY_SPI_SCB_TYPE, (void*)(SPI_Send_data), 4);
};

void TLE9185_HW_CTRL_Set(HW_CTRL_cfg_t HW_CTRL_cfg)
{
  uint16_t ToSend = ((HW_CTRL_cfg.TSD2_DEL << 12) | (HW_CTRL_cfg.VS_OV_SEL << 11) | (HW_CTRL_cfg.SH_DISABLE << 10) | (HW_CTRL_cfg.RSTN_DEL << 9) | (HW_CTRL_cfg.SOFT_RESET_RO << 6) | (HW_CTRL_cfg.WD_STM_EN_1 << 2));
  SPI_WriteReg(REG_ADDR_HW_CTRL, ToSend);
}

void TLE9185_M_S_CTRL_Set(M_S_CTRL_cfg_t M_S_CTRL_cfg)
{
  uint16_t ToSend = ((M_S_CTRL_cfg.MODE << 14) | (M_S_CTRL_cfg.VCC1_OV_MOD << 9) | (M_S_CTRL_cfg.RSTN_HYS << 7) | (M_S_CTRL_cfg.I_PEAK_TH << 5) | (M_S_CTRL_cfg.VCC1_RT << 0));
  SPI_WriteReg(REG_ADDR_M_S_CTRL, ToSend);
}

void TLE9185_INT_MASK_Set(INT_MASK_cfg_t INT_MASK_cfg)
{
  uint16_t ToSend = ((INT_MASK_cfg.INTN_CYC_EN << 8) | (INT_MASK_cfg.WD_SDM_DISABLE << 7) | (INT_MASK_cfg.WD_SDM << 6) | (INT_MASK_cfg.SPI_CRC_FAIL << 5) | (INT_MASK_cfg.BD_STAT << 4) | (INT_MASK_cfg.TEMP_STAT << 1) | (INT_MASK_cfg.SUPPLY_STAT << 0));
  SPI_WriteReg(REG_ADDR_INT_MASK, ToSend);
}

void TLE9185_HB_ICHG_Set(HB_ICHG_cfg_t HB_ICHG_cfg, bool ACTorFW, uint8_t HB)
{
  
  uint16_t ToSend  = ((HB_ICHG_cfg.IDCHG<<10) & 0xFC00) | ((HB_ICHG_cfg.ICHG<<4) & 0x03F0) | (((ACTorFW<<2)|HB)& 0x000F);
  SPI_WriteReg(REG_ADDR_HB_ICHG, ToSend);
};

void TLE9185_CCP_BLK_Set(CCP_BLK_cfg_t CCP_BLK_cfg, bool ACTorFW, uint8_t HB)
{
  uint16_t ToSend = ((CCP_BLK_cfg.TBLANK<<12)&0xF000) | ((CCP_BLK_cfg.TCCP<<8)&0xF00) | (((ACTorFW<<2)|HB)& 0x000F);
  SPI_WriteReg(REG_ADDR_CCP_BLK, ToSend);
};

void TLE9185_PCHG_INIT_Set(PCHG_INIT_cfg_t PCHG_INIT_cfg, uint8_t init_bnk)
{
  uint16_t ToSend  = ((PCHG_INIT_cfg.PDCHGINIT<<10) & 0xFC00) | ((PCHG_INIT_cfg.PCHGINIT<<4) & 0x03F0) | (init_bnk& 0x7);
  SPI_WriteReg(REG_ADDR_HB_PCHG_INIT, ToSend);
};

void TLE9185_TDON_HB_CTRL_Set(TDON_HB_CTRL_cfg_t TDON_HB_CTRL_cfg, uint8_t hb_tdon_bnk)
{
  uint16_t ToSend  = ((TDON_HB_CTRL_cfg.TDON<<8) & 0x3F00) | (hb_tdon_bnk & 0x7);
  SPI_WriteReg(REG_ADDR_TDON_HB_CTRL, ToSend);
};

void TLE9185_TDOFF_HB_CTRL_Set(TDOFF_HB_CTRL_cfg_t TDOFF_HB_CTRL_cfg, uint8_t hb_tdoff_bnk)
{
  uint16_t ToSend  = ((TDOFF_HB_CTRL_cfg.TDOFF<<8) & 0x3F00) | (hb_tdoff_bnk & 0x7);
  SPI_WriteReg(REG_ADDR_TDOFF_HB_CTRL, ToSend);
};

void TLE9185_TPRECHG_Set(uint8_t t_pchgx, uint8_t t_pdchgx)
{
  uint16_t ToSend = 0;
  ToSend = ((t_pchgx << 10) & 0x1C00)| ((t_pchgx << 7) & 0x380)| ((t_pchgx << 4) & 0x70);
  SPI_WriteReg(REG_ADDR_TPRECHG, ToSend);				// Set Precharge time
  
  ToSend = ((t_pdchgx << 10) & 0x1C00)| ((t_pdchgx << 7) & 0x380)| ((t_pdchgx << 4) & 0x70) | (0x001);
  SPI_WriteReg(REG_ADDR_TPRECHG, ToSend);	
};

void TLE9185_HB_ICHG_MAX_Set(uint8_t hbxidiag, uint8_t ichgMaxx)
{
  uint16_t ToSend = 0;
  
  for(uint8_t i=0; i < 3; i++)
  {
    ToSend = ToSend | ((hbxidiag<<(i+12)) |  (ichgMaxx<<(i*2)));
  }
  
