rezaandriady/T2G_TLE9185_BLDC_MotorControl/TLE9185_BLDC.c
  SPI_WriteReg(REG_ADDR_HB_ICHG_MAX, ToSend);
};

void TLE9185_ST_ICHG_Set(uint8_t ichgst1, uint8_t ichgst2, uint8_t ichgst3)
{
  uint16_t ToSend  = ((ichgst3<<8) & 0x0F00) | ((ichgst2<<4) & 0x00F0) | (ichgst1 & 0x000F);
  SPI_WriteReg(REG_ADDR_ST_ICHG, ToSend);
};

void TLE9185_GENCTRL_Set()
{
  uint16_t ToSend = 0;
  ToSend = (1<<15)|(0<<12)|(1<<11)|(1<<10)|(1<<9)|(0<<8)|(1<<6)|(1<<5)|(0<<4)|(0<<3)|(0<<2)|(0<<1)|(0<<0);
  SPI_WriteReg(REG_ADDR_GENCTRL, ToSend);
};

void TLE9185_HS_VDS_Set(uint8_t vdsth, bool deep_adap, uint8_t tfvds)
{
  uint16_t ToSend = ((deep_adap<<12) & 0x1000) | ((vdsth<<9) & 0xE00) | ((vdsth<<6) & 0x1C0) | ((vdsth<<3) & 0x38) | (vdsth & 0x7);
  SPI_WriteReg(REG_ADDR_HS_VDS, ToSend);
};

void TLE9185_LS_VDS_Set(uint8_t vdsth, bool deep_adap, uint8_t tfvds)
{
  uint16_t ToSend = ((tfvds<<12) & 0x3000) | ((vdsth<<9) & 0xE00) | ((vdsth<<6) & 0x1C0) | ((vdsth<<3) & 0x38) | (vdsth & 0x7);
  SPI_WriteReg(REG_ADDR_LS_VDS, ToSend);
};

void TLE9185_CSA_Set(uint8_t octh, uint8_t csag, bool ocen)
{
  uint16_t ToSend = 0;
  ToSend = ((0<<10)&0x400)|((1<<9)&0x200)|((1<<8)&0x100)|((1<<6)&0xC0)|((0<<5)&0x20)|((3<<3)&0x18)|((2<<1)&0x6)|(0&0x0);
  SPI_WriteReg(REG_ADDR_CSA, ToSend);
};

void TLE9185_WD_CTRL_Set(WD_CTRL_cfg_t WD_CTRL)
{
  WD_CTRL_data = ((WD_CTRL.CHECKSUM << 15) | (WD_CTRL.WD_STM_EN_0 << 6) | (WD_CTRL.WD_CFG << 5) | (WD_CTRL.WD_TIMER));
  SPI_WriteReg(REG_ADDR_WD_CTRL, WD_CTRL_data);
};

void TLE9185_HBMODE_Set(HBMODE_cfg_t PWMA, HBMODE_cfg_t PWMB, HBMODE_cfg_t PWMC)
{
  uint16_t HBMODE_data;
  
  HBMODE_data = (PWMA.HBmode<<2) | (PWMA.AFW<<1) | (PWMA.PWM_EN<<0);
  HBMODE_data |= (PWMB.HBmode<<6) | (PWMB.AFW<<5) | (PWMB.PWM_EN<<4);
  HBMODE_data |= (PWMC.HBmode<<10) | (PWMC.AFW<<9) | (PWMC.PWM_EN)<<8;
  
  SPI_WriteReg(REG_ADDR_HBMODE, HBMODE_data);
}

void Timer_Init()
{
  cy_stc_tcpwm_counter_config_t timer_cfg =
  {
    .period             = 15625ul - 1ul,                        // 15,625 / 15625 = 1Hz
    .clockPrescaler     = CY_TCPWM_PRESCALER_DIVBY_128,         // 2,000,000Hz / 128 = 15,625Hz
    .runMode            = CY_TCPWM_COUNTER_CONTINUOUS,
    .countDirection     = CY_TCPWM_COUNTER_COUNT_UP,
    .debug_pause        = 0uL,
    .compareOrCapture   = CY_TCPWM_COUNTER_MODE_COMPARE,
    .compare0           = 0ul,
    .compare0_buff      = 0ul,
    .compare1           = 0ul,
    .compare1_buff      = 0ul,
    .enableCompare0Swap = false,
    .enableCompare1Swap = false,
    .interruptSources   = CY_TCPWM_INT_NONE,
    .capture0InputMode  = CY_TCPWM_INPUT_LEVEL,
    .capture0Input      = 0ul,
    .reloadInputMode    = CY_TCPWM_INPUT_LEVEL,
    .reloadInput        = 0ul,
    .startInputMode     = CY_TCPWM_INPUT_LEVEL,
    .startInput         = 0ul,
    .stopInputMode      = CY_TCPWM_INPUT_LEVEL,
    .stopInput          = 0ul,
    .capture1InputMode  = CY_TCPWM_INPUT_LEVEL,
    .capture1Input      = 0ul,
    .countInputMode     = CY_TCPWM_INPUT_LEVEL,
    .countInput         = 1ul,
    .trigger0EventCfg   = CY_TCPWM_COUNTER_OVERFLOW,
    .trigger1EventCfg   = CY_TCPWM_COUNTER_OVERFLOW,
  };
  
  cy_stc_sysint_irq_t timer_irq_cfg = 
  {
    .sysIntSrc  = Timer_WD_IRQN,
    .intIdx     = CPUIntIdx3_IRQn,
    .isEnabled  = true,
  };
  
  uint32_t targetFreq = 2000000ul;
  uint32_t divNum = (80000000ul / targetFreq);
  CY_ASSERT((80000000ul % targetFreq) == 0ul);
  
  Cy_SysClk_PeriphAssignDivider(Timer_WD_PCLK, CY_SYSCLK_DIV_16_BIT, Timer_DIV_NUM);
  Cy_SysClk_PeriphAssignDivider(Timer_100ms_PCLK, CY_SYSCLK_DIV_16_BIT, Timer_DIV_NUM);
  Cy_SysClk_PeriphAssignDivider(Timer_10ms_PCLK, CY_SYSCLK_DIV_16_BIT, Timer_DIV_NUM);
  Cy_SysClk_PeriphSetDivider(CY_SYSCLK_DIV_16_BIT, Timer_DIV_NUM, (divNum-1ul));  
  Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_16_BIT, Timer_DIV_NUM);
  
  // Timer WD
  Cy_SysInt_InitIRQ(&timer_irq_cfg);
  Cy_SysInt_SetSystemIrqVector(timer_irq_cfg.sysIntSrc, Timer_WD_Handler);
  
  // Timer 100ms
  timer_irq_cfg.sysIntSrc = Timer_100ms_IRQN;
  Cy_SysInt_InitIRQ(&timer_irq_cfg);
  Cy_SysInt_SetSystemIrqVector(timer_irq_cfg.sysIntSrc, Timer_100ms_Handler);
  
  timer_irq_cfg.sysIntSrc = Timer_10ms_IRQN;
  Cy_SysInt_InitIRQ(&timer_irq_cfg);
  Cy_SysInt_SetSystemIrqVector(timer_irq_cfg.sysIntSrc, Timer_10ms_Handler);
  
  NVIC_SetPriority(timer_irq_cfg.intIdx, 3ul);
  NVIC_EnableIRQ(timer_irq_cfg.intIdx);
  
  // Timer WD
  Cy_Tcpwm_Counter_Init(Timer_WD_TYPE, &timer_cfg);
  
  // Timer 100ms
  timer_cfg.period = 3125;
  timer_cfg.clockPrescaler     = CY_TCPWM_PRESCALER_DIVBY_64, 
  Cy_Tcpwm_Counter_Init(Timer_100ms_TYPE, &timer_cfg);
  
  // Timer 100ms
  timer_cfg.period = 625;
  timer_cfg.clockPrescaler     = CY_TCPWM_PRESCALER_DIVBY_32, 
  Cy_Tcpwm_Counter_Init(Timer_10ms_TYPE, &timer_cfg);
  
  Cy_Tcpwm_Counter_Enable(Timer_WD_TYPE);
  Cy_Tcpwm_Counter_Enable(Timer_100ms_TYPE);
  Cy_Tcpwm_Counter_Enable(Timer_10ms_TYPE);
  
  Cy_Tcpwm_Counter_SetTC_IntrMask(Timer_WD_TYPE); 
  Cy_Tcpwm_Counter_SetTC_IntrMask(Timer_100ms_TYPE);
  Cy_Tcpwm_Counter_SetTC_IntrMask(Timer_10ms_TYPE);
  
  Cy_Tcpwm_TriggerStart(Timer_WD_TYPE);
  Cy_Tcpwm_TriggerStart(Timer_100ms_TYPE);
  Cy_Tcpwm_TriggerStart(Timer_10ms_TYPE);
};

void Timer_10ms_Handler(void)
{
  if(Cy_Tcpwm_Counter_GetTC_IntrMasked(Timer_10ms_TYPE) == 1ul)
  {
    Cy_Adc_Channel_SoftwareTrigger(&PASS0_SAR1->CH[ADC_LOGICAL_CHANNEL]);
    Cy_Tcpwm_Counter_ClearTC_Intr(Timer_10ms_TYPE);
  }
}

void Timer_100ms_Handler(void)
{
  if(Cy_Tcpwm_Counter_GetTC_IntrMasked(Timer_100ms_TYPE) == 1ul)
  {
    hall_buffer_idx = (hall_buffer_idx + 1) % HALL_CHANGE_BUFFER_SIZE;
    hall_change_count_temp_buff[hall_buffer_idx] = hall_change_count_temp;
    hall_change_count_temp = 0;
    
    int sum = 0;
    for (int i = 0; i < HALL_CHANGE_BUFFER_SIZE; i++)
    {
      sum += hall_change_count_temp_buff[i];
    }
    hall_change_count = (uint32_t) (sum / HALL_CHANGE_BUFFER_SIZE);    
    
    if (!hall_change_count && hall_count_target)
    {
      BLDC_rampup = 1;
    } else if (hall_change_count)
    {
      BLDC_rampup = 0;
    }
    
    OCD_CNT = 0;
    
#if (PID_UDPDATE) // PID
    PWM_CC0 = clamp(PWM_CC0 + PID_Update(&pid, hall_change_count, hall_count_target), 1, 200);
#else // Simple PWM_CC0 Increment/ Decrement
    PWM_CC0 = clamp(PWM_CC0_Update(), 1, 200);
#endif
    Cy_Tcpwm_Counter_ClearTC_Intr(Timer_100ms_TYPE);
  }
}

void Timer_WD_Handler(void)
{
  if(Cy_Tcpwm_Counter_GetTC_IntrMasked(Timer_WD_TYPE) == 1ul)
  {
    // Feed TLE9185 Trigger
    //SPI_ReadReg(REG_ADDR_WD_CTRL);
    
    // Count RPM
    Hall_RPM_Count();
    
    Cy_Adc_Channel_SoftwareTrigger(&BB_POTI_ANALOG_MACRO->CH[ADC_LOGICAL_CHANNEL]);
    
    // ADC
    if (POT_ADC_RES > 120)
    {
      hall_count_target = POT_ADC_RES / 120;
    } else
    {
      hall_count_target = 0;
    }
    
    Cy_Tcpwm_Counter_ClearTC_Intr(Timer_WD_TYPE);
  }
};

void Hall_Init()
{
  cy_stc_gpio_pin_config_t const hall_ch_pin_cfg =
  {
    .outVal    = 0ul,
    .driveMode = CY_GPIO_DM_HIGHZ, //Check
    .hsiom     = 0,
    .intEdge   = CY_GPIO_INTR_DISABLE,
    .intMask   = 0ul,
    .vtrip     = 0ul,
    .slewRate  = 0ul,
    .driveSel  = 0ul,
  };
  
  Cy_GPIO_Pin_Init(GPIO_PRT7, 3, &hall_ch_pin_cfg); //HALL1
  Cy_GPIO_Pin_Init(GPIO_PRT7, 4, &hall_ch_pin_cfg); //HALL2
  Cy_GPIO_Pin_Init(GPIO_PRT7, 5, &hall_ch_pin_cfg); //HALL3
};

void Hall_RPM_Count()
{
  hall_RPM = (hall_change_count << 2);
};

void PWM_Init()
{
  cy_stc_gpio_pin_config_t pwm_ch_pin_cfg =
  {
    .outVal    = 0ul,
    .driveMode = CY_GPIO_DM_STRONG_IN_OFF,
    .hsiom     = 8,
    .intEdge   = 0ul,
    .intMask   = 0ul,
    .vtrip     = 0ul,
    .slewRate  = 0ul,
    .driveSel  = 0ul,
  };
  
  cy_stc_tcpwm_pwm_config_t const pwm_ch_cfg =
  {
    .pwmMode            = CY_TCPWM_PWM_MODE_PWM,
    .clockPrescaler     = CY_TCPWM_PRESCALER_DIVBY_1,
    .cc0MatchMode       = CY_TCPWM_PWM_TR_CTRL2_CLEAR,
    .overflowMode       = CY_TCPWM_PWM_TR_CTRL2_SET,
    .runMode            = CY_TCPWM_PWM_CONTINUOUS,
    .period             = PWM_PERIOD,
    .compare0           = PWM_CC0,
    .compare0_buff      = PWM_CC0,
    .enableCompare0Swap = true,
    .killMode           = CY_TCPWM_PWM_STOP_ON_KILL,
    .switchInputMode    = CY_TCPWM_INPUT_RISING_EDGE,
    .switchInput        = 5ul,
    .kill0InputMode     = CY_TCPWM_INPUT_RISING_EDGE,
    .kill1Input         = 6ul,
    .startInputMode     = CY_TCPWM_INPUT_RISING_EDGE,
    .startInput         = 7ul,
    .countInputMode     = CY_TCPWM_INPUT_LEVEL,
    .countInput         = 1ul,
  };
  
  Cy_GPIO_Pin_Init(GPIO_PRT19, 2, &pwm_ch_pin_cfg); //PWMA
  Cy_GPIO_Pin_Init(GPIO_PRT23, 3, &pwm_ch_pin_cfg); //PWMB
  Cy_GPIO_Pin_Init(GPIO_PRT22, 3, &pwm_ch_pin_cfg); //PWMC
  
  uint32_t targetFreq = 8000000ul;
  uint32_t div = (80000000ul/ targetFreq);
  
  Cy_SysClk_PeriphAssignDivider(PWM_A_PCLK, CY_SYSCLK_DIV_16_BIT, PWM_DIV_NUM);
  Cy_SysClk_PeriphAssignDivider(PWM_B_PCLK, CY_SYSCLK_DIV_16_BIT, PWM_DIV_NUM);
  Cy_SysClk_PeriphAssignDivider(PWM_C_PCLK, CY_SYSCLK_DIV_16_BIT, PWM_DIV_NUM);
  
