rezaandriady/T2G_TLE9185_BLDC_MotorControl/TLE9185_BLDC.c
  Cy_SysClk_PeriphSetDivider(CY_SYSCLK_DIV_16_BIT, PWM_DIV_NUM, (div-1ul));
  
  Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_16_BIT, PWM_DIV_NUM);
  
  Cy_Tcpwm_Pwm_Init(PWM_A_TYPE, &pwm_ch_cfg);
  Cy_Tcpwm_Pwm_Init(PWM_B_TYPE, &pwm_ch_cfg);
  Cy_Tcpwm_Pwm_Init(PWM_C_TYPE, &pwm_ch_cfg);
  
  Cy_Tcpwm_Pwm_Enable(PWM_A_TYPE);
  Cy_Tcpwm_Pwm_Enable(PWM_B_TYPE);
  Cy_Tcpwm_Pwm_Enable(PWM_C_TYPE);
};

void PWM_BLDC_Control()
{
  // Read Hall States
  hall_state = (GPIO_PRT7->unIN.u32Register >> 3);
  
  if ((hall_state == 7) || (hall_state == 0))
  {
    return;
  }

  if (old_hall_state == hall_state && !BLDC_rampup)
  {
    return;
  }
  
  if (old_hall_state != hall_state)
  {
    hall_change_count_temp++;
  }
  
  old_hall_state = hall_state;
  
  PWM_A_TYPE->unTR_CMD.stcField.u1STOP = 1;
  PWM_B_TYPE->unTR_CMD.stcField.u1STOP = 1;
  PWM_C_TYPE->unTR_CMD.stcField.u1STOP = 1;
  
  Cy_SysTick_DelayInUs(10);
 
  // Next BLDC Sector
  {
    uint8_t hall_state_index = 0;
    for (uint8_t i = 0; i < 6; i++) 
    {
      if (hall_state_table[i] == hall_state) 
      {
        hall_state_index = i;
        break;
      }
    }
    
    if (motor_dir)
    {
      bldc_state = hall_state_table[(hall_state_index == 5)? 0 : hall_state_index+1];
    } else
    {
      bldc_state = hall_state_table[(hall_state_index == 0)? 5 : hall_state_index-1];
    }
  }
  
  switch (bldc_state)
  {
  case 1:
    TLE9185_HBMODE_Set(Active_PWM, Active_GND, Floating);
    PWM_B_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_C_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_A_TYPE->unCC0.stcField.u32CC = PWM_CC0;
    PWM_A_TYPE->unTR_CMD.stcField.u1START = 1;
    break;
    
  case 2:
    TLE9185_HBMODE_Set(Active_PWM, Floating, Active_GND);
    PWM_B_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_C_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_A_TYPE->unCC0.stcField.u32CC = PWM_CC0;
    PWM_A_TYPE->unTR_CMD.stcField.u1START = 1;
    break;
    
  case 3:
    TLE9185_HBMODE_Set(Floating, Active_PWM, Active_GND);
    PWM_A_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_C_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_B_TYPE->unCC0.stcField.u32CC = PWM_CC0;
    PWM_B_TYPE->unTR_CMD.stcField.u1START = 1;
    break;
    
  case 4:
    TLE9185_HBMODE_Set(Active_GND, Active_PWM, Floating);
    PWM_A_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_C_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_B_TYPE->unCC0.stcField.u32CC = PWM_CC0;
    PWM_B_TYPE->unTR_CMD.stcField.u1START = 1;
    break;
    
  case 5:
    TLE9185_HBMODE_Set(Active_GND, Floating, Active_PWM);
    PWM_A_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_B_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_C_TYPE->unCC0.stcField.u32CC = PWM_CC0;
    PWM_C_TYPE->unTR_CMD.stcField.u1START = 1;
    break;
    
  case 6:
    TLE9185_HBMODE_Set(Floating, Active_GND, Active_PWM);
    PWM_A_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_B_TYPE->unTR_CMD.stcField.u1STOP = 1;
    PWM_C_TYPE->unCC0.stcField.u32CC = PWM_CC0;
    PWM_C_TYPE->unTR_CMD.stcField.u1START = 1;
    break;
    
  default:
    Cy_SysTick_DelayInUs(10);
    break;
  }
}

void PID_Reset(PID_t *pid) {
  pid->integral = 0.0f;
  pid->prevErr = 0.0f;
}

if (PID_UPDATE)
int PID_Update(PID_t *pid, int val, int target) {
  float dt = pid->dt;  
  float err = (float)(target - val);
  float P = pid->Kp * err;
  
  pid->integral += err * dt;
  float I = pid->Ki * pid->integral;
  
  float derivative = (pid->prevErr - err) / dt;
  float D = pid->Kd * derivative;
  pid->prevErr = err;
  int pidval = (int)(P + I - D);
  
  return (int)(P + I - D);
}
#else
int PWM_CC0_Update()
{
  if (hall_change_count < hall_count_target)
  {
    if ((hall_count_target - hall_change_count) > 20)
    {
      return (int)(PWM_CC0 + 5);
    } else
    {
      return (int)(PWM_CC0 + 1);
    }
  } else if (hall_change_count > hall_count_target)
  {
    if ((hall_change_count - hall_count_target) > 20)
    {
      return (int)(PWM_CC0 - 5);
    } else
    {
      return (int)(PWM_CC0 - 1);
    }
  }
  else if (hall_change_count == hall_count_target)
  {
    return (int)PWM_CC0;
  }
}
#endif

int clamp(int val, int min, int max) {
  if (val < min) return min;
  if (val > max) return max;
  return val;
}

void SPI_Init()
{
  cy_stc_gpio_pin_config_t spi_pin_cfg =
  {
    .outVal    = 0ul,
    .driveMode = CY_GPIO_DM_STRONG_IN_OFF,
    .hsiom     = 19,
    .intEdge   = 0ul,
    .intMask   = 0ul,
    .vtrip     = 0ul,
    .slewRate  = 0ul,
    .driveSel  = 0ul,
  };
  
  cy_stc_gpio_pin_config_t const spi_cs_pin_cfg =
  {
    .outVal    = 1ul,
    .driveMode = CY_GPIO_DM_STRONG_IN_OFF,
    .hsiom     = 0,
    .intEdge   = 0ul,
    .intMask   = 0ul,
    .vtrip     = 0ul,
    .slewRate  = 0ul,
    .driveSel  = 0ul,
  };
  
  static const cy_stc_scb_spi_config_t SCB_SPI_cfg =
  {
    .spiMode                    = CY_SCB_SPI_MASTER,      /*** Specifies the mode of operation    ***/
    .subMode                    = CY_SCB_SPI_MOTOROLA,    /*** Specifies the sub mode of SPI operation    ***/
    .sclkMode                   = CY_SCB_SPI_CPHA1_CPOL0,
    .oversample                 = SCB_SPI_OVERSAMPLING,   /*** SPI_CLOCK divided by SCB_SPI_OVERSAMPLING should be baudrate  ***/
    .rxDataWidth                = 8ul,                   /*** The width of RX data (valid range 4-16). It must be the same as \ref txDataWidth except in National sub-mode. ***/
    .txDataWidth                = 8ul,                   /*** The width of TX data (valid range 4-16). It must be the same as \ref rxDataWidth except in National sub-mode. ***/
    .enableMsbFirst             = false,                   /*** Enables the hardware to shift out the data element MSB first, otherwise, LSB first ***/
    .enableFreeRunSclk          = false,                  /*** Enables the master to generate a continuous SCLK regardless of whether there is data to send  ***/
    .enableInputFilter          = false,                  /*** Enables a digital 3-tap median filter to be applied to the input of the RX FIFO to filter glitches on the line. ***/
    .enableMisoLateSample       = true,                   /*** Enables the master to sample MISO line one half clock later to allow better timings. ***/
    .enableTransferSeperation   = false,                   /*** Enables the master to transmit each data element separated by a de-assertion of the slave select line (only applicable for the master mode) ***/
    .ssPolarity0                = false,                  /*** SS0: active low ***/
    .ssPolarity1                = false,                  /*** SS1: active low ***/
    .ssPolarity2                = false,                  /*** SS2: active low ***/
    .ssPolarity3                = false,                  /*** SS3: active low ***/
    .enableWakeFromSleep        = false,                  /*** When set, the slave will wake the device when the slave select line becomes active. Note that not all SCBs support this mode. Consult the device datasheet to determine which SCBs support wake from deep sleep. ***/
    .rxFifoTriggerLevel         = 1ul,                    /*** Interrupt occurs, when there are more entries of 2 in the RX FIFO */
    .rxFifoIntEnableMask        = 0ul,                    /*** Bits set in this mask will allow events to cause an interrupt  */
    .txFifoTriggerLevel         = 0ul,                    /*** When there are fewer entries in the TX FIFO, then at this level the TX trigger output goes high. This output can be connected to a DMA channel through a trigger mux. Also, it controls the \ref CY_SCB_SPI_TX_TRIGGER interrupt source. */
    .txFifoIntEnableMask        = 0ul,                    /*** Bits set in this mask allow events to cause an interrupt  */
    .masterSlaveIntEnableMask   = 0ul,                    /*** Bits set in this mask allow events to cause an interrupt  */
    .enableSpiDoneInterrupt     = true,
    .enableSpiBusErrorInterrupt = false,
  };
  
