rezaandriady/T2G_TLE9185_BLDC_MotorControl/TLE9185_BLDC.c
  static cy_stc_sysint_irq_t spi_irq_cfg =
  {
    .sysIntSrc  = CY_SPI_SCB_IRQN,
    .intIdx     = CPUIntIdx3_IRQn,
    .isEnabled  = true,
  };
  
  Cy_GPIO_Pin_Init(GPIO_PRT22, 2, &spi_pin_cfg); //SCL
  Cy_GPIO_Pin_Init(GPIO_PRT22, 1, &spi_pin_cfg); //MOSI
  spi_pin_cfg.driveMode = CY_GPIO_DM_HIGHZ;
  Cy_GPIO_Pin_Init(GPIO_PRT22, 0, &spi_pin_cfg); //MISO
  Cy_GPIO_Pin_Init(GPIO_PRT21, 5, &spi_cs_pin_cfg); //CS
  
  Cy_SysClk_PeriphAssignDivider(CY_SPI_SCB_PCLK, CY_SYSCLK_DIV_24_5_BIT, DIVIDER_NO_1);
  SetPeripheFracDiv24_5(SCB_SPI_CLOCK_FREQ, SOURCE_CLOCK_FRQ, DIVIDER_NO_1);
  Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_24_5_BIT, 1u);
  
  Cy_SCB_SPI_DeInit(CY_SPI_SCB_TYPE);
  
  Cy_SysInt_InitIRQ(&spi_irq_cfg);
  Cy_SysInt_SetSystemIrqVector(spi_irq_cfg.sysIntSrc, SPI_ISR);
  NVIC_EnableIRQ(spi_irq_cfg.intIdx);
  
  Cy_SCB_SPI_Init(CY_SPI_SCB_TYPE, &SCB_SPI_cfg, NULL);
  CY_SPI_SCB_TYPE->unINTR_M_MASK.stcField.u1SPI_DONE = 0x1;

  Cy_SCB_SPI_SetActiveSlaveSelect(CY_SPI_SCB_TYPE, 0ul);
  Cy_SCB_SPI_Enable(CY_SPI_SCB_TYPE);

  Cy_GPIO_Write(GPIO_PRT21, 5, 1);
};

void SPI_WriteReg(uint8_t addr, uint16_t data)
{
  while (SPI_Pending);
  
  SPI_Pending = 1;
  Cy_GPIO_Write(GPIO_PRT21, 5, 0);
  
  SPI_Send_data[0] = (addr | TLE9xxx_CMD_WRITE);
  SPI_Send_data[1] = data & 0xFF;
  SPI_Send_data[2] = (data >> 8) & 0xFF;
  SPI_Send_data[3] = 0xA5;
  Cy_SCB_SPI_WriteArray(CY_SPI_SCB_TYPE, (void*)(SPI_Send_data), 4);
};

void SPI_ReadReg(uint8_t addr)
{
  while (SPI_Pending);
  
  SPI_Pending = 1;
  Cy_GPIO_Write(GPIO_PRT21, 5, 0);
  
  SPI_Send_data[0] = (addr | TLE9xxx_CMD_READ);
  SPI_Send_data[1] = 0xFF;
  SPI_Send_data[2] = 0xFF;
  SPI_Send_data[3] = 0xA5;
  Cy_SCB_SPI_WriteArray(CY_SPI_SCB_TYPE, (void*)(SPI_Send_data), 4);
}

void SPI_ISR(void)
{
  uint32_t SPI_IRQ_Status;
  
  SPI_IRQ_Status = Cy_SCB_SPI_IsTxComplete(CY_SPI_SCB_TYPE);
  if(SPI_IRQ_Status)
  {
    Cy_GPIO_Write(GPIO_PRT21, 5, 1);
    
    Cy_SCB_SPI_ReadArray(CY_SPI_SCB_TYPE, (void*)SPI_Read_data, 4);
    
    SPI_Pending = 0;
    Cy_SCB_SPI_ClearSlaveMasterStatus(CY_SPI_SCB_TYPE, CY_SCB_SPI_MASTER_DONE);
  }
};

void POT_ADC_ISR(void)
{
  cy_stc_adc_interrupt_source_t intrSource = { false };
  Cy_Adc_Channel_GetInterruptMaskedStatus(&BB_POTI_ANALOG_MACRO->CH[ADC_LOGICAL_CHANNEL], &intrSource);
  
  if(intrSource.grpDone)
  {
    Cy_Adc_Channel_GetResult(&BB_POTI_ANALOG_MACRO->CH[ADC_LOGICAL_CHANNEL], &POT_ADC_RES, &POT_ADC_STAT);
    Cy_Adc_Channel_ClearInterruptStatus(&BB_POTI_ANALOG_MACRO->CH[ADC_LOGICAL_CHANNEL], &intrSource);
  }
}

void CSO_ADC_ISR(void)
{
  cy_stc_adc_interrupt_source_t intrSource = { false };
  Cy_Adc_Channel_GetInterruptMaskedStatus(&PASS0_SAR1->CH[ADC_LOGICAL_CHANNEL], &intrSource);
  
  if(intrSource.chRange)
  {
    Cy_Adc_Channel_GetResult(&PASS0_SAR1->CH[ADC_LOGICAL_CHANNEL], &CSO_ADC_RES, &CSO_ADC_STAT);
    
    if (CSO_ADC_RES > CSO_ADC_THRESH)
    {
      OCD_CNT++;
    }

    if (OCD_CNT > OCD_CNT_THRESH) 
    {
      OCD_CNT = 0;
      if (OCD_ACT_RESET)
      {
        BLDC_reset = 1;
      }
    }
    
    Cy_Adc_Channel_ClearInterruptStatus(&PASS0_SAR1->CH[ADC_LOGICAL_CHANNEL], &intrSource);
  }
}

void ADC_Init(void)
{
  cy_stc_gpio_pin_config_t adcPinConfig =
  {
    .outVal    = 0ul,
    .driveMode = CY_GPIO_DM_ANALOG,
    .hsiom     = CY_ADC_POT_PIN_MUX,
    .intEdge   = 0ul,
    .intMask   = 0ul,
    .vtrip     = 0ul,
    .slewRate  = 0ul,
    .driveSel  = 0ul,
  };
  Cy_GPIO_Pin_Init(CY_ADC_POT_PORT, CY_ADC_POT_PIN, &adcPinConfig);
  Cy_GPIO_Pin_Init(GPIO_PRT13, 2, &adcPinConfig);
  
  uint32_t actualAdcOperationFreq;
  {
    uint32_t periFreq = 80000000ul;
    uint32_t divNum = DIV_ROUND_UP(periFreq, ADC_OPERATION_FREQUENCY_MAX_IN_HZ);
    actualAdcOperationFreq = periFreq / divNum;
    Cy_SysClk_PeriphAssignDivider(BB_POTI_ANALOG_PCLK, CY_SYSCLK_DIV_16_BIT, 0ul);
    Cy_SysClk_PeriphAssignDivider(PCLK_PASS0_CLOCK_SAR1, CY_SYSCLK_DIV_16_BIT, 0ul);
    Cy_SysClk_PeriphSetDivider(CY_SYSCLK_DIV_16_BIT, 0ul, (divNum - 1ul));
    Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_16_BIT, 0ul);
  }
  
  uint32_t samplingCycle = (uint32_t)DIV_ROUND_UP((ANALOG_IN_SAMPLING_TIME_MIN_IN_NS * (uint64_t)actualAdcOperationFreq), 1000000000ull);
  
  cy_stc_adc_config_t adcConfig =
  {
    .preconditionTime    = 0u,
    .powerupTime         = 0u,
    .enableIdlePowerDown = false,
    .msbStretchMode      = CY_ADC_MSB_STRETCH_MODE_1CYCLE,
    .enableHalfLsbConv   = 0u,
    .sarMuxEnable        = true,
    .adcEnable           = true,
    .sarIpEnable         = true,
  };
  
  cy_stc_adc_channel_config_t adcChannelConfig =
  {
    .triggerSelection          = CY_ADC_TRIGGER_OFF,
    .channelPriority           = 0u,
    .preenptionType            = CY_ADC_PREEMPTION_FINISH_RESUME,
    .isGroupEnd                = true,
    .doneLevel                 = CY_ADC_DONE_LEVEL_PULSE,
    .pinAddress                = BB_POTI_ANALOG_INPUT_NO,
    .portAddress               = CY_ADC_PORT_ADDRESS_SARMUX0,
    .extMuxSelect              = 0u,
    .extMuxEnable              = true,
    .preconditionMode          = CY_ADC_PRECONDITION_MODE_OFF,
    .overlapDiagMode           = CY_ADC_OVERLAP_DIAG_MODE_OFF,
    .sampleTime                = samplingCycle,
    .calibrationValueSelect    = CY_ADC_CALIBRATION_VALUE_REGULAR,
    .postProcessingMode        = CY_ADC_POST_PROCESSING_MODE_NONE,
    .resultAlignment           = CY_ADC_RESULT_ALIGNMENT_RIGHT,
    .signExtention             = CY_ADC_SIGN_EXTENTION_UNSIGNED,
    .averageCount              = 0u,
    .rightShift                = 0u,
    .rangeDetectionMode        = CY_ADC_RANGE_DETECTION_MODE_INSIDE_RANGE,
    .rangeDetectionLoThreshold = 0x0000u,
    .rangeDetectionHiThreshold = 0x0FFFu,
    .mask.grpDone              = true,
    .mask.grpCancelled         = false,
    .mask.grpOverflow          = false,
    .mask.chRange              = false,
    .mask.chPulse              = false,
    .mask.chOverflow           = false,
  };
  
  Cy_Adc_Init(BB_POTI_ANALOG_MACRO, &adcConfig);
  Cy_Adc_Channel_Init(&BB_POTI_ANALOG_MACRO->CH[ADC_LOGICAL_CHANNEL], &adcChannelConfig);
  
