rezaandriady/T2G_TLE9185_BLDC_MotorControl/TLE9185_BLDC.c
  adcChannelConfig.pinAddress                   = ((cy_en_adc_pin_address_t)14);
  adcChannelConfig.postProcessingMode           = CY_ADC_POST_PROCESSING_MODE_RANGE,
  adcChannelConfig.rangeDetectionMode           = CY_ADC_RANGE_DETECTION_MODE_OUTSIDE_RANGE;
  adcChannelConfig.rangeDetectionHiThreshold    = 0x0BFF;
  adcChannelConfig.mask.grpDone                 = false;
  adcChannelConfig.mask.chRange                 = true;
  
  Cy_Adc_Init(PASS0_SAR1, &adcConfig);
  Cy_Adc_Channel_Init(&PASS0_SAR1->CH[ADC_LOGICAL_CHANNEL], &adcChannelConfig);
   
  {
    cy_stc_sysint_irq_t irq_cfg;
    irq_cfg = (cy_stc_sysint_irq_t){
      .sysIntSrc  = (cy_en_intr_t)((uint32_t)CY_ADC_POT_IRQN + ADC_LOGICAL_CHANNEL),
      .intIdx     = CPUIntIdx3_IRQn,
      .isEnabled  = true,
    };
    
    Cy_SysInt_InitIRQ(&irq_cfg);
    Cy_SysInt_SetSystemIrqVector(irq_cfg.sysIntSrc, POT_ADC_ISR);
    
    irq_cfg.sysIntSrc = (cy_en_intr_t)((uint32_t)pass_0_interrupts_sar_32_IRQn + ADC_LOGICAL_CHANNEL);
    Cy_SysInt_InitIRQ(&irq_cfg);
    Cy_SysInt_SetSystemIrqVector(irq_cfg.sysIntSrc, CSO_ADC_ISR);
    
    NVIC_SetPriority(irq_cfg.intIdx, 0ul);
    NVIC_EnableIRQ(irq_cfg.intIdx);
  }
  
  Cy_Adc_Channel_Enable(&BB_POTI_ANALOG_MACRO->CH[ADC_LOGICAL_CHANNEL]);
  Cy_Adc_Channel_Enable(&PASS0_SAR1->CH[ADC_LOGICAL_CHANNEL]);
  
  Cy_Adc_Channel_SoftwareTrigger(&BB_POTI_ANALOG_MACRO->CH[ADC_LOGICAL_CHANNEL]);
  Cy_Adc_Channel_SoftwareTrigger(&PASS0_SAR1->CH[ADC_LOGICAL_CHANNEL]);
}

void SetPeripheFracDiv24_5(uint64_t targetFreq, uint64_t sourceFreq, uint8_t divNum)
{
  uint64_t temp = ((uint64_t)sourceFreq << 5ull);
  uint32_t divSetting;
  
  divSetting = (uint32_t)(temp / targetFreq);
  Cy_SysClk_PeriphSetFracDivider(CY_SYSCLK_DIV_24_5_BIT, divNum, 
                                 (((divSetting >> 5ul) & 0x00000FFFul) - 1ul), 
                                 (divSetting & 0x0000001Ful));
};

/* [] END OF FILE */
